/*
排序是将一群数据，依指定的顺序进行排列的过程。  
排序的分类:  
1.内部排序:  
指将需要处理的所有数据都加载到内部存储器中进行排序。包括(交换式排序法、选择式排序法和插入式排序法);

2.外部排序法:  
数据量过大，无法全部加载到内存中，需要借助外部存储进行排序。包括(合并排序法和直接合并排序法)。

冒泡排序法  
冒泡排序(Bubble Sorting)的基本思想是:通过对待排序序列从后向前(从下标较大的元素开始)，依次比较相邻元素的值，若发现逆序则交换，使值较大的元素逐渐从前移向后部，就象水底下的气泡一样逐渐向上冒。

分析冒泡排序数组  
[24,69,80,57,13]  
第1轮排序:目标把最大数放在最后  
第1次比较[24,69,80,57,13]  
第2次比较[24,69,80,57,13]  
第3次比较[24,69,57,80,13]  
第4次比较[24,69,57,13,80]

第2轮排序:目标把第二大数放在倒数第二位置  
第1次比较[24,69,57,13,80]  
第2次比较[24,57,69,13,80]  
第3次比较[24,57,13,69,80]

第3轮排序:目标把第3大数放在倒数第3位置  
第1次比较[24,57,13,69,80]  
第2次比较[24,13,57,69,80]

第4轮排序:目标把第4大数放在倒数第4位置第  
1次比较[13,24,57,69,80]

总结冒泡排序特点  
1.我们一共有5个元素  
2.一共进行了4轮排序，可以看成是外层循环  
3.每1轮排序可以确定一个数的位置，比如第1轮排序确定最大数，第2轮排序，确定第2大的数位置，依次类推  
4.当进行比较时，如果前面的数大于后面的数，就交换  
5.每轮比较在减少4->3->2->1
*/ 
import java.util.Arrays;
public class BubbleSort {
  public static void main(String[] args) {
    // 冒泡排序法案例:
    // 我们将五个无序:24,69,80,57,13 使用冒泡排序法将其排成一个从小到大的有序数列。

    // 化繁为简，先死后活
    int[] arr = {24,69,80,57,13};
    for(int i = 0; i < arr.length - 1; i++) { // 外层循环，控制轮数
      for(int j = 0; j < arr.length -1 -i; j++) { //内层循环，控制比较次数
        if(arr[j] > arr[j+1]) { //比较相邻元素，如果前者大于后者，则交换位置
          int temp = arr[j];
          arr[j] = arr[j+1];
          arr[j+1] = temp; //交换位置
        }

      }
        System.out.println("交换后数组为：" + Arrays.toString(arr));

    }
  }
}
