/*
多维数组-二维数组  
二维数组的使用  
方式一：动态初始化  
1.语法:类型][]数组名=new 类型[大小][大小]  
比:int a[][]=new int[2][3]

方式二：动态初始化  
1.先声明:类型数组名[][];  
2.再定义(开辟空间)数组名=new类型[大小][大小]  
3.赋值(有默认值，比如int类型的就是0)

方式三：动态初始化-列数不确定（每个一维数组个数不确定）

方式四：静态初始化  
定义类型数组名[][]={{值1，值2..},{值1,值2..},{值1,值2..}}
*/ 
public class TwoDimensionalArray {
  public static void main(String[] args) {
  /*
  请用二维数组输出如下图形
  000000
  001000
  020300
  000000
  */ 
  //什么是二维数组:
  //从定义形式上看int[][]
  //可以这样理解，原来的一维数组的每个元素是一维数组，就构成二维数组  
  int[][] arr = {{0,0,0,0,0,0},{0,1,0,0,0,0},{0,2,3,0,0,0},{0,0,0,0,0,0}};

  // 关于二维数组的关键概念
  System.out.println("二维数组的行数为:" + arr.length);
  // 二维数组的每个元素是一维数组，所以如果需要得到每个一维数组的值还需要再次遍历
  // 如果我们要访问第(i+1)个一维数组的第j+1个值 arr[i[j];

  //  输出二维数组
  for(int i = 0; i < arr.length; i++) {
    // 遍历二维数组的每一行
    for(int j = 0; j < arr[i].length; j++) {
      System.out.print(arr[i][j] + "\t");// 输出二维数组的元素
    }
    System.out.println();// 换行
  }
  }
}
