/*
注意事项和使用细节  
访问修饰符(作用是控制 方法使用的范围)  
如果不写默认访问，[有四种:public protected 默认 private]，具体在后面说

1.一个方法最多有一个返回值[思考，如何返回多个结果?]  
2.返回类型可以为任意类型，包含基本类型或引用类型(数组，对象)  
3.如果方法要求有返回数据类型，则方法体中最后的执行语句必须为return值;而  
且要求返回值类型必须和return的值类型一致或兼容  
如果方法是void，则方法体中可以没有return语句，或者 只写return;  
方法名遵循驼峰命名法，最好见名知义，表达出该功能的意思即可，比如得到两个数的和getSum，开发中按照规范

形参列表  
1.一个方法可以有0个参数，也可以有多个参数，中间用逗号隔开，比如 getSum(int n1,int n2)  
2.参数类型可以为任意类型，包含基本类型或引用类型，比如printArr(int[][] map)  
3.调用带参数的方法时，一定对应着参数列表传入相同类型或兼容类型 的参数!【getSum]  
3.方法定义时的参数称为形式参数，简称形参;方法调用时的传入参数称为实际参数，简称实参，实参和形参的类型要一致或兼容、个数、顺序必须一致![演示]

方法体  
里面写完成功能的具体的语句，可以为输入、输出、变量、运算、分支、循环、方法调用，但里面不能再定义方法!即:方法不能嵌套定义。[演示]
*/ 
public class MethodDetail {
  public static void main(String[] args) {
    Aa aa = new Aa();
    int[] res = aa.getSunAndSub(10, 20);
    System.out.println("结果是：" + res[0] + " " + res[1]);
  }
}

class Aa {
  // 1.一个方法最多有一个返回值[思考，如何返回多个结果?]  
  public  int[] getSunAndSub(int a, int b) {
    return new int[] {a + b, a - b};
  }
}
